In [1]:
# importing pandas and numpy

import pandas as pd

import numpy as np

In [2]:
# importing data

df = pd.read_csv(r'C:\Users\CharlesYi\Jupyter Notebook\Alteryx Challenges\Challenge 381_Average Monthly Sales with a Twist\Employee_sales_data.csv')

In [3]:
df.head()

,Employee ID,Employee Name,January,February,March,April,May,June,July,August,September,October,November,December
0,1,Barbara Somers,0,8,3,3,0,5,3,6,1,7,0,6
1,2,Benjamin Portal,2,6,2,3,4,4,3,3,1,5,4,5
2,3,Beth Silverstein,0,7,7,2,0,8,6,0,9,0,3,0
3,4,Carinne Cardona,2,4,1,0,3,3,5,1,9,7,1,6
4,5,Chahait Singh,0,0,12,0,0,0,10,9,0,3,0,2

In [4]:
df.shape

(50, 14)

In [5]:
# transposing on employee ID and employee name

df_pivoted = pd.melt(df, id_vars = ['Employee ID', 'Employee Name'], var_name = 'month', value_name = 'sales')

df_pivoted.head()

   Employee ID     Employee Name    month  sales
0            1    Barbara Somers  January      0
1            2   Benjamin Portal  January      2
2            3  Beth Silverstein  January      0
3            4   Carinne Cardona  January      2
4            5     Chahait Singh  January      0

In [6]:
# changing month to datetime

df_pivoted['month_num'] = pd.to_datetime(df_pivoted['month'], format = '%B')

df_pivoted.head()

   Employee ID     Employee Name    month  sales  month_num
0            1    Barbara Somers  January      0 1900-01-01
1            2   Benjamin Portal  January      2 1900-01-01
2            3  Beth Silverstein  January      0 1900-01-01
3            4   Carinne Cardona  January      2 1900-01-01
4            5     Chahait Singh  January      0 1900-01-01

In [7]:
# changing month_num to integer

df_pivoted['month_num'] = df_pivoted['month_num'].dt.strftime('%m')

df_pivoted.head()

   Employee ID     Employee Name    month  sales month_num
0            1    Barbara Somers  January      0        01
1            2   Benjamin Portal  January      2        01
2            3  Beth Silverstein  January      0        01
3            4   Carinne Cardona  January      2        01
4            5     Chahait Singh  January      0        01

In [8]:
# sorting df by employee id, month num and resetting index

df_pivoted.sort_values(by = ['Employee ID', 'month_num'], ascending = True, inplace = True)

df_pivoted.reset_index(drop = True, inplace = True)

df_sorted = df_pivoted

In [9]:
# identifying first sales for each employee

def first_sales_func (group):
    
    first_sales = []
    
    for index, row in group.iterrows():
        
        if row['sales'] == 0:
            first_sales.append('not_first')
        
        elif row['sales'] != 0 and (not first_sales or 'first' not in first_sales):
            first_sales.append('first')
        
        elif row['sales'] != 0 and first_sales[-1] == 'first':
            first_sales.append('not_first')
            
        else:
            first_sales.append('not_first')
            
    series = pd.Series(first_sales, index=group.index)
    
    group['sequence'] = series
            
    return group['sequence']

In [10]:
df_first = df_sorted

In [11]:
# applying function

df_first['sequence'] = df_sorted.groupby('Employee ID').apply(first_sales_func).explode().reset_index(drop = True)

In [12]:
df_first.head(36)

    Employee ID     Employee Name      month  sales month_num   sequence
0             1    Barbara Somers    January      0        01  not_first
1             1    Barbara Somers   February      8        02      first
2             1    Barbara Somers      March      3        03  not_first
3             1    Barbara Somers      April      3        04  not_first
4             1    Barbara Somers        May      0        05  not_first
5             1    Barbara Somers       June      5        06  not_first
6             1    Barbara Somers       July      3        07  not_first
7             1    Barbara Somers     August      6        08  not_first
8             1    Barbara Somers  September      1        09  not_first
9             1    Barbara Somers    October      7        10  not_first
10            1    Barbara Somers   November      0        11  not_first
11            1    Barbara Somers   December      6        12  not_first
12            2   Benjamin Portal    January      2        01      first
13            2   Benjamin Portal   February      6        02  not_first
14            2   Benjamin Portal      March      2        03  not_first
15            2   Benjamin Portal      April      3        04  not_first
16            2   Benjamin Portal        May      4        05  not_first
17            2   Benjamin Portal       June      4        06  not_first
18            2   Benjamin Portal       July      3        07  not_first
19            2   Benjamin Portal     August      3        08  not_first
20            2   Benjamin Portal  September      1        09  not_first
21            2   Benjamin Portal    October      5        10  not_first
22            2   Benjamin Portal   November      4        11  not_first
23            2   Benjamin Portal   December      5        12  not_first
24            3  Beth Silverstein    January      0        01  not_first
25            3  Beth Silverstein   February      7        02      first
26            3  Beth Silverstein      March      7        03  not_first
27            3  Beth Silverstein      April      2        04  not_first
28            3  Beth Silverstein        May      0        05  not_first
29            3  Beth Silverstein       June      8        06  not_first
30            3  Beth Silverstein       July      6        07  not_first
31            3  Beth Silverstein     August      0        08  not_first
32            3  Beth Silverstein  September      9        09  not_first
33            3  Beth Silverstein    October      0        10  not_first
34            3  Beth Silverstein   November      3        11  not_first
35            3  Beth Silverstein   December      0        12  not_first

In [31]:
# defining function to determine second and third sales

def subsequent_sales (group):
    
    subsequent_sales_list = []
    
    for index, row in group.iterrows():
        
        if row['sequence'] == 'first':
            subsequent_sales_list.append('first')
            
        elif subsequent_sales_list and subsequent_sales_list[-1] == 'first':
            subsequent_sales_list.append('second')
        
        elif subsequent_sales_list and subsequent_sales_list[-1] == 'second':
            subsequent_sales_list.append('third')
        
        else:
            subsequent_sales_list.append('disregard')
            
    series = pd.Series(subsequent_sales_list, index = group.index)
    
    group['sequence2'] = series
    
    return group['sequence2']

In [32]:
df_subsequent = df_first

In [38]:
# applying function

df_subsequent['sequence2'] = df_first.groupby('Employee ID').apply(subsequent_sales).explode().reset_index(drop = True)

In [40]:
df_subsequent.head(36)

,Employee ID,Employee Name,month,sales,month_num,sequence,sequence2
0,1,Barbara Somers,January,0,01,not_first,disregard
1,1,Barbara Somers,February,8,02,first,first
2,1,Barbara Somers,March,3,03,not_first,second
3,1,Barbara Somers,April,3,04,not_first,third
4,1,Barbara Somers,May,0,05,not_first,disregard
5,1,Barbara Somers,June,5,06,not_first,disregard
6,1,Barbara Somers,July,3,07,not_first,disregard
7,1,Barbara Somers,August,6,08,not_first,disregard
8,1,Barbara Somers,September,1,09,not_first,disregard
9,1,Barbara Somers,October,7,10,not_first,disregard
10,1,Barbara Somers,November,0,11,not_first,disregard
11,1,Barbara Somers,December,6,12,not_first,disregard
12,2,Benjamin Portal,January,2,01,first,first
13,2,Benjamin Portal,February,6,02,not_first,second
14,2,Benjamin Portal,March,2,03,not_first,third
15,2,Benjamin Portal,April,3,04,not_first,disregard
16,2,Benjamin Portal,May,4,05,not_first,disregard
17,2,Benjamin Portal,June,4,06,not_first,disregard
18,2,Benjamin Portal,July,3,07,not_first,disregard
19,2,Benjamin Portal,August,3,08,not_first,disregard
20,2,Benjamin Portal,September,1,09,not_first,disregard
21,2,Benjamin Portal,October,5,10,not_first,disregard
22,2,Benjamin Portal,November,4,11,not_first,disregard
23,2,Benjamin Portal,December,5,12,not_first,disregard
24,3,Beth Silverstein,January,0,01,not_first,disregard
25,3,Beth Silverstein,February,7,02,first,first
26,3,Beth Silverstein,March,7,03,not_first,second
27,3,Beth Silverstein,April,2,04,not_first,third
28,3,Beth Silverstein,May,0,05,not_first,disregard
29,3,Beth Silverstein,June,8,06,not_first,disregard
30,3,Beth Silverstein,July,6,07,not_first,disregard
31,3,Beth Silverstein,August,0,08,not_first,disregard
32,3,Beth Silverstein,September,9,09,not_first,disregard
33,3,Beth Silverstein,October,0,10,not_first,disregard
34,3,Beth Silverstein,November,3,11,not_first,disregard
35,3,Beth Silverstein,December,0,12,not_first,disregard

In [42]:
# filtering out disregards

df_filtered = df_subsequent[df_subsequent['sequence2'] != 'disregard']

df_filtered.shape

(150, 7)

In [58]:
# calculating average rate of first three months of sales and rounding for each employee

df_filtered.groupby(['Employee ID', 'Employee Name']).agg(avg_sales = ('sales', lambda x: round(x.mean(), 2))).reset_index()

    Employee ID      Employee Name  avg_sales
0             1     Barbara Somers       4.67
1             2    Benjamin Portal       3.33
2             3   Beth Silverstein       5.33
3             4    Carinne Cardona       2.33
4             5      Chahait Singh       4.00
5             6  Christina Decosta       3.33
6             7   Christopher Eten       2.00
7             8      Craig Coleman       5.00
8             9      Daniel Kohane       3.67
9            10     Dylan O'Rourke      11.00
10           11  Edward Firouztale       3.67
11           12        Eric Fanaee       2.00
12           13       Eric Shapiro       5.00
13           14       Faisal Malik       2.00
14           15       Jean Futoran       2.67
15           16  Jillian Peragallo       4.67
16           17        Joel Thomas       1.67
17           18      Jonathan Lown       3.33
18           19       Kelly Dunphy       2.67
19           20     Kevin Johnston       2.67
20           21       Kirby Turner       2.33
21           22      Kristen Klein       1.00
22           23     Laurie Wallace       3.33
23           24      Lisa Trentino       2.67
24           25        Luis Fandos       3.00
25           26          Mark Wood       3.00
26           27      Mark Sterling       2.67
27           28        Mary Carter       4.00
28           29    Matthew Spiegel       4.33
29           30  Mehran Golpariani       9.33
30           31     Melinda Clarke       1.33
31           32      Myassar Zarif       1.67
32           33   Peter Lascarides       2.33
33           34  Reginald Rousseau       3.67
34           35      Robert McCord       3.67
35           36        Ruth Bochat       3.00
36           37        Sally Ciron       1.67
37           38   Scott McWilliams       3.67
38           39         Shafi Wani       3.00
39           40    Shakira Shanker       3.00
40           41     Stella Abayeva       1.00
41           42  Stephanie Aguirre       2.00
42           43       Sunil Albert       2.00
43           44   Thomas Yarrobino       2.67
44           45      Timothy Groth       3.00
45           46       Todd Maltese       2.67
46           47      Umali Caparas       3.33
47           48       Vandana Soni       1.67
48           49     Warren Spinner       3.00
49           50       Yaseen Karim       1.00